; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	spectrograph0 - mode
	image3 - mode
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Planet7)
	(pointing satellite1 Star4)
	(have_image Star5 thermograph2)
	(have_image Phenomenon6 image3)
	(have_image Planet7 image3)
	(have_image Star8 spectrograph0)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 spectrograph1)
	(have_image Star12 image3)
	(have_image Planet13 thermograph2)
))

)

; plan
1. (turn_to satellite1 star0 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star0)
   goals met: 0 of 11
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite1 planet13 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet13)
   goals met: 0 of 11
5. (take_image satellite1 planet13 instrument3 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon10 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 11
7. (turn_to satellite0 groundstation1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 11
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 11
9. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 11
10. (take_image satellite1 phenomenon10 instrument3 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 2 of 11
11. (turn_to satellite0 phenomenon6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 11
12. (take_image satellite0 phenomenon6 instrument0 image3)
   added: (have_image phenomenon6 image3)
   goals met: 3 of 11
13. (turn_to satellite0 star11 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star11)
   goals met: 3 of 11
14. (take_image satellite0 star11 instrument0 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 4 of 11
15. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 4 of 11
16. (take_image satellite0 star12 instrument0 image3)
   added: (have_image star12 image3)
   goals met: 5 of 11
17. (turn_to satellite0 planet7 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet7)
   goals met: 6 of 11
18. (take_image satellite0 planet7 instrument0 image3)
   added: (have_image planet7 image3)
   goals met: 7 of 11
19. (turn_to satellite1 planet9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet9)
   goals met: 7 of 11
20. (take_image satellite1 planet9 instrument3 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 8 of 11
21. (turn_to satellite1 star5 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star5)
   goals met: 8 of 11
22. (take_image satellite1 star5 instrument3 thermograph2)
   added: (have_image star5 thermograph2)
   goals met: 9 of 11
23. (turn_to satellite1 star8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star8)
   goals met: 9 of 11
24. (take_image satellite1 star8 instrument3 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 10 of 11
25. (turn_to satellite1 star4 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star4)
   goals met: 11 of 11
